Show / Hide Table of Contents
Class ResultOfDeformation2
Result of deformation in the one positon
Inheritance
System.Object
ResultOfLoading2
ResultOfDeformation2
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
[Obsolete]
public class ResultOfDeformation2 : ResultOfLoading2
Constructors
Improve this Doc   View Source
ResultOfDeformation2()
Constructor
Declaration
public ResultOfDeformation2()
Properties
Improve this Doc   View Source
Fix
Rotation around x-axis
Declaration
public double Fix { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fiy
Rotation around y-axis
Declaration
public double Fiy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fiz
Rotation around z-axis
Declaration
public double Fiz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Loading
LoadingTypeClass
Declaration
public Loading Loading { get; set; }
Property Value
 Type |  Description
 Loading
Improve this Doc   View Source
Ux
Deformation in the x direction
Declaration
public double Ux { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Uy
Deformation in the y direction
Declaration
public double Uy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Uz
Deformation in the z direction
Declaration
public double Uz { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source